# shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.common.module.cockroachdb_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production-cockroachdb-serverless-cluster-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "serverless-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common.module.cockroachdb_serverless_cluster.cockroach_cluster.default will be created
  + resource "cockroach_cluster" "default" {
      + account_id        = (known after apply)
      + cloud_provider    = "AWS"
      + cockroach_version = (known after apply)
      + creator_id        = (known after apply)
      + id                = (known after apply)
      + name              = "production-connectilly"
      + operation_status  = (known after apply)
      + plan              = (known after apply)
      + regions           = [
          + {
              + name       = "us-east-1"
              + node_count = (known after apply)
              + primary    = (known after apply)
              + sql_dns    = (known after apply)
              + ui_dns     = (known after apply)
            },
        ]
      + serverless        = {
          + routing_id  = (known after apply)
          + spend_limit = 0
        }
      + state             = (known after apply)
      + upgrade_status    = (known after apply)
    }

  # module.common.module.kafka_serverless_cluster.aws_ssm_parameter.default will be created
  + resource "aws_ssm_parameter" "default" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "production-kafka-cluster-id"
      + tags           = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tags_all       = {
          + "environment"   = "production"
          + "resource"      = "shared"
          + "resource_type" = "kafka-cluster"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.common.module.kafka_serverless_cluster.upstash_kafka_cluster.default will be created
  + resource "upstash_kafka_cluster" "default" {
      + cluster_id              = (known after apply)
      + cluster_name            = "production-connectilly"
      + creation_time           = (known after apply)
      + id                      = (known after apply)
      + max_message_size        = (known after apply)
      + max_messages_per_second = (known after apply)
      + max_partitions          = (known after apply)
      + max_retention_size      = (known after apply)
      + max_retention_time      = (known after apply)
      + multizone               = false
      + password                = (sensitive value)
      + region                  = "us-east-1"
      + rest_endpoint           = (known after apply)
      + state                   = (known after apply)
      + tcp_endpoint            = (known after apply)
      + type                    = (known after apply)
      + username                = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*